import random

from telegram.ext import run_async, Filters

from telegram import Message, Chat, Update, Bot, MessageEntity

from MashaRoBot import dispatcher

from MashaRoBot.modules.disable import DisableAbleCommandHandler

SFW_STRINGS = (

    "Oᴡᴡᴡ ... Sᴜᴄʜ ᴀ sᴛᴜᴘɪᴅ ɪᴅɪᴏᴛ.",

    "Dᴏɴ'ᴛ ᴅʀɪɴᴋ ᴀɴᴅ ᴛʏᴘᴇ.",

    "I ᴛʜɪɴᴋ ʏᴏᴜ sʜᴏᴜʟᴅ ɢᴏ ʜᴏᴍᴇ ᴏʀ ʙᴇᴛᴛᴇʀ ᴀ ᴍᴇɴᴛᴀʟ ᴀsʏʟᴜᴍ.",

    "Cᴏᴍᴍᴀɴᴅ ɴᴏᴛ ғᴏᴜɴᴅ. Jᴜsᴛ ʟɪᴋᴇ ʏᴏᴜʀ ʙʀᴀɪɴ.",

    "Dᴏ ʏᴏᴜ ʀᴇᴀʟɪᴢᴇ ʏᴏᴜ ᴀʀᴇ ᴍᴀᴋɪɴɢ ᴀ ғᴏᴏʟ ᴏғ ʏᴏᴜʀsᴇʟғ? Aᴘᴘᴀʀᴇɴᴛʟʏ ɴᴏᴛ.",

    "Yᴏᴜ ᴄᴀɴ ᴛʏᴘᴇ ʙᴇᴛᴛᴇʀ ᴛʜᴀɴ ᴛʜᴀᴛ.",

    "Bᴏᴛ ʀᴜʟᴇ 544 sᴇᴄᴛɪᴏɴ 9 ᴘʀᴇᴠᴇɴᴛs ᴍᴇ ғʀᴏᴍ ʀᴇᴘʟʏɪɴɢ ᴛᴏ sᴛᴜᴘɪᴅ ʜᴜᴍᴀɴs ʟɪᴋᴇ ʏᴏᴜ.",

    "Sᴏʀʀʏ, ᴡᴇ ᴅᴏ ɴᴏᴛ sᴇʟʟ ʙʀᴀɪɴs.",

    "Bᴇʟɪᴇᴠᴇ ᴍᴇ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ɴᴏʀᴍᴀʟ.",

    "I ʙᴇᴛ ʏᴏᴜʀ ʙʀᴀɪɴ ғᴇᴇʟs ᴀs ɢᴏᴏᴅ ᴀs ɴᴇᴡ, sᴇᴇɪɴɢ ᴛʜᴀᴛ ʏᴏᴜ ɴᴇᴠᴇʀ ᴜsᴇ ɪᴛ.",

    "Iғ I ᴡᴀɴᴛᴇᴅ ᴛᴏ ᴋɪʟʟ ᴍʏsᴇʟғ I'ᴅ ᴄʟɪᴍʙ ʏᴏᴜʀ ᴇɢᴏ ᴀɴᴅ ᴊᴜᴍᴘ ᴛᴏ ʏᴏᴜʀ IQ.",

    "Zᴏᴍʙɪᴇs ᴇᴀᴛ ʙʀᴀɪɴs... ʏᴏᴜ'ʀᴇ sᴀғᴇ.",

    "Yᴏᴜ ᴅɪᴅɴ'ᴛ ᴇᴠᴏʟᴠᴇ ғʀᴏᴍ ᴀᴘᴇs, ᴛʜᴇʏ ᴇᴠᴏʟᴠᴇᴅ ғʀᴏᴍ ʏᴏᴜ.",

    "Cᴏᴍᴇ ʙᴀᴄᴋ ᴀɴᴅ ᴛᴀʟᴋ ᴛᴏ ᴍᴇ ᴡʜᴇɴ ʏᴏᴜʀ I.Q. ᴇxᴄᴇᴇᴅs ʏᴏᴜʀ ᴀɢᴇ.",

    "I'ᴍ ɴᴏᴛ sᴀʏɪɴɢ ʏᴏᴜ'ʀᴇ sᴛᴜᴘɪᴅ, I'ᴍ ᴊᴜsᴛ sᴀʏɪɴɢ ʏᴏᴜ'ᴠᴇ ɢᴏᴛ ʙᴀᴅ ʟᴜᴄᴋ ᴡʜᴇɴ ɪᴛ ᴄᴏᴍᴇs ᴛᴏ ᴛʜɪɴᴋɪɴɢ.",

    "Wʜᴀᴛ ʟᴀɴɢᴜᴀɢᴇ ᴀʀᴇ ʏᴏᴜ sᴘᴇᴀᴋɪɴɢ? Cᴀᴜsᴇ ɪᴛ sᴏᴜɴᴅs ʟɪᴋᴇ ʙᴜʟʟsʜɪᴛ.",

    "Sᴛᴜᴘɪᴅɪᴛʏ ɪs ɴᴏᴛ ᴀ ᴄʀɪᴍᴇ sᴏ ʏᴏᴜ ᴀʀᴇ ғʀᴇᴇ ᴛᴏ ɢᴏ.",

    "Yᴏᴜ ᴀʀᴇ ᴘʀᴏᴏғ ᴛʜᴀᴛ ᴇᴠᴏʟᴜᴛɪᴏɴ CAN ɢᴏ ɪɴ ʀᴇᴠᴇʀsᴇ.",

    "I ᴡᴏᴜʟᴅ ᴀsᴋ ʏᴏᴜ ʜᴏᴡ ᴏʟᴅ ʏᴏᴜ ᴀʀᴇ ʙᴜᴛ I ᴋɴᴏᴡ ʏᴏᴜ ᴄᴀɴ'ᴛ ᴄᴏᴜɴᴛ ᴛʜᴀᴛ ʜɪɢʜ.",

    "As ᴀɴ ᴏᴜᴛsɪᴅᴇʀ, ᴡʜᴀᴛ ᴅᴏ ʏᴏᴜ ᴛʜɪɴᴋ ᴏғ ᴛʜᴇ ʜᴜᴍᴀɴ ʀᴀᴄᴇ?",

    "Bʀᴀɪɴs ᴀʀᴇɴ'ᴛ ᴇᴠᴇʀʏᴛʜɪɴɢ. Iɴ ʏᴏᴜʀ ᴄᴀsᴇ ᴛʜᴇʏ'ʀᴇ ɴᴏᴛʜɪɴɢ.",

    "Oʀᴅɪɴᴀʀɪʟʏ ᴘᴇᴏᴘʟᴇ ʟɪᴠᴇ ᴀɴᴅ ʟᴇᴀʀɴ. Yᴏᴜ ᴊᴜsᴛ ʟɪᴠᴇ.",

    "I ᴅᴏɴ'ᴛ ᴋɴᴏᴡ ᴡʜᴀᴛ ᴍᴀᴋᴇs ʏᴏᴜ sᴏ sᴛᴜᴘɪᴅ, ʙᴜᴛ ɪᴛ ʀᴇᴀʟʟʏ ᴡᴏʀᴋs.",

    "Kᴇᴇᴘ ᴛᴀʟᴋɪɴɢ, sᴏᴍᴇᴅᴀʏ ʏᴏᴜ'ʟʟ sᴀʏ sᴏᴍᴇᴛʜɪɴɢ ɪɴᴛᴇʟʟɪɢᴇɴᴛ! (I ᴅᴏᴜʙᴛ ɪᴛ ᴛʜᴏᴜɢʜ)",

    "Sʜᴏᴄᴋ ᴍᴇ, sᴀʏ sᴏᴍᴇᴛʜɪɴɢ ɪɴᴛᴇʟʟɪɢᴇɴᴛ.",

    "Yᴏᴜʀ IQ's ʟᴏᴡᴇʀ ᴛʜᴀɴ ʏᴏᴜʀ sʜᴏᴇ sɪᴢᴇ.",

    "Aʟᴀs! Yᴏᴜʀ ɴᴇᴜʀᴏᴛʀᴀɴsᴍɪᴛᴛᴇʀs ᴀʀᴇ ɴᴏ ᴍᴏʀᴇ ᴡᴏʀᴋɪɴɢ.",

    "Aʀᴇ ʏᴏᴜ ᴄʀᴀᴢʏ ʏᴏᴜ ғᴏᴏʟ.",

    "Eᴠᴇʀʏᴏɴᴇ ʜᴀs ᴛʜᴇ ʀɪɢʜᴛ ᴛᴏ ʙᴇ sᴛᴜᴘɪᴅ ʙᴜᴛ ʏᴏᴜ ᴀʀᴇ ᴀʙᴜsɪɴɢ ᴛʜᴇ ᴘʀɪᴠɪʟᴇɢᴇ.",

    "I'ᴍ sᴏʀʀʏ I ʜᴜʀᴛ ʏᴏᴜʀ ғᴇᴇʟɪɴɢs ᴡʜᴇɴ I ᴄᴀʟʟᴇᴅ ʏᴏᴜ sᴛᴜᴘɪᴅ. I ᴛʜᴏᴜɢʜᴛ ʏᴏᴜ ᴀʟʀᴇᴀᴅʏ ᴋɴᴇᴡ ᴛʜᴀᴛ.",

    "Yᴏᴜ sʜᴏᴜʟᴅ ᴛʀʏ ᴛᴀsᴛɪɴɢ ᴄʏᴀɴɪᴅᴇ.",

    "Yᴏᴜʀ ᴇɴᴢʏᴍᴇs ᴀʀᴇ ᴍᴇᴀɴᴛ ᴛᴏ ᴅɪɢᴇsᴛ ʀᴀᴛ ᴘᴏɪsᴏɴ.",

    "Yᴏᴜ sʜᴏᴜʟᴅ ᴛʀʏ sʟᴇᴇᴘɪɴɢ ғᴏʀᴇᴠᴇʀ.",

    "Yᴏᴜ ᴄᴏᴜʟᴅ ᴍᴀᴋᴇ ᴀ ᴡᴏʀʟᴅ ʀᴇᴄᴏʀᴅ ʙʏ ᴊᴜᴍᴘɪɴɢ ғʀᴏᴍ ᴀ ᴘʟᴀɴᴇ ᴡɪᴛʜᴏᴜᴛ ᴘᴀʀᴀᴄʜᴜᴛᴇ.",

    "Sᴛᴏᴘ ᴛᴀʟᴋɪɴɢ BS ᴀɴᴅ ᴊᴜᴍᴘ ɪɴ ғʀᴏɴᴛ ᴏғ ᴀ ʀᴜɴɴɪɴɢ ʙᴜʟʟᴇᴛ ᴛʀᴀɪɴ.",

    "Tʀʏ ʙᴀᴛʜɪɴɢ ᴡɪᴛʜ Hʏᴅʀᴏᴄʜʟᴏʀɪᴄ Aᴄɪᴅ ɪɴsᴛᴇᴀᴅ ᴏғ ᴡᴀᴛᴇʀ.",

    "Tʀʏ ᴛʜɪs: ɪғ ʏᴏᴜ ʜᴏʟᴅ ʏᴏᴜʀ ʙʀᴇᴀᴛʜ ᴜɴᴅᴇʀᴡᴀᴛᴇʀ ғᴏʀ ᴀɴ ʜᴏᴜʀ, ʏᴏᴜ ᴄᴀɴ ᴛʜᴇɴ ʜᴏʟᴅ ɪᴛ ғᴏʀᴇᴠᴇʀ.",

    "Gᴏ Gʀᴇᴇɴ! Sᴛᴏᴘ ɪɴʜᴀʟɪɴɢ Oxʏɢᴇɴ.",

    "Gᴏᴅ ᴡᴀs sᴇᴀʀᴄʜɪɴɢ ғᴏʀ ʏᴏᴜ. Yᴏᴜ sʜᴏᴜʟᴅ ʟᴇᴀᴠᴇ ᴛᴏ ᴍᴇᴇᴛ ʜɪᴍ.",

    "ɢɪᴠᴇ ʏᴏᴜʀ 100%. Nᴏᴡ, ɢᴏ ᴅᴏɴᴀᴛᴇ ʙʟᴏᴏᴅ.",

    "Tʀʏ ᴊᴜᴍᴘɪɴɢ ғʀᴏᴍ ᴀ ʜᴜɴᴅʀᴇᴅ sᴛᴏʀʏ ʙᴜɪʟᴅɪɴɢ ʙᴜᴛ ʏᴏᴜ ᴄᴀɴ ᴅᴏ ɪᴛ ᴏɴʟʏ ᴏɴᴄᴇ.",

    "Yᴏᴜ sʜᴏᴜʟᴅ ᴅᴏɴᴀᴛᴇ ʏᴏᴜʀ ʙʀᴀɪɴ sᴇᴇɪɴɢ ᴛʜᴀᴛ ʏᴏᴜ ɴᴇᴠᴇʀ ᴜsᴇᴅ ɪᴛ.",

    "Vᴏʟᴜɴᴛᴇᴇʀ ғᴏʀ ᴛᴀʀɢᴇᴛ ɪɴ ᴀɴ ғɪʀɪɴɢ ʀᴀɴɢᴇ.",

    "Hᴇᴀᴅ sʜᴏᴛs ᴀʀᴇ ғᴜɴ. Gᴇᴛ ʏᴏᴜʀsᴇʟғ ᴏɴᴇ.",

    "Yᴏᴜ sʜᴏᴜʟᴅ ᴛʀʏ sᴡɪᴍᴍɪɴɢ ᴡɪᴛʜ ɢʀᴇᴀᴛ ᴡʜɪᴛᴇ sʜᴀʀᴋs.",

    "Yᴏᴜ sʜᴏᴜʟᴅ ᴘᴀɪɴᴛ ʏᴏᴜʀsᴇʟғ ʀᴇᴅ ᴀɴᴅ ʀᴜɴ ɪɴ ᴀ ʙᴜʟʟ ᴍᴀʀᴀᴛʜᴏɴ.",

    "Yᴏᴜ ᴄᴀɴ sᴛᴀʏ ᴜɴᴅᴇʀᴡᴀᴛᴇʀ ғᴏʀ ᴛʜᴇ ʀᴇsᴛ ᴏғ ʏᴏᴜʀ ʟɪғᴇ ᴡɪᴛʜᴏᴜᴛ ᴄᴏᴍɪɴɢ ʙᴀᴄᴋ ᴜᴘ.",

    "Hᴏᴡ ᴀʙᴏᴜᴛ ʏᴏᴜ sᴛᴏᴘ ʙʀᴇᴀᴛʜɪɴɢ ғᴏʀ ʟɪᴋᴇ 1 ᴅᴀʏ? Tʜᴀᴛ'ʟʟ ʙᴇ ɢʀᴇᴀᴛ.",

    "Tʀʏ ᴘʀᴏᴠᴏᴋɪɴɢ ᴀ ᴛɪɢᴇʀ ᴡʜɪʟᴇ ʏᴏᴜ ʙᴏᴛʜ ᴀʀᴇ ɪɴ ᴀ ᴄᴀɢᴇ.",

    "Hᴀᴠᴇ ʏᴏᴜ ᴛʀɪᴇᴅ sʜᴏᴏᴛɪɴɢ ʏᴏᴜʀsᴇʟғ ᴀs ʜɪɢʜ ᴀs 100ᴍ ᴜsɪɴɢ ᴀ ᴄᴀɴᴏɴ.",

    "Yᴏᴜ sʜᴏᴜʟᴅ ᴛʀʏ ʜᴏʟᴅɪɴɢ TNT ɪɴ ʏᴏᴜʀ ᴍᴏᴜᴛʜ ᴀɴᴅ ɪɢɴɪᴛɪɴɢ ɪᴛ.",

    "Tʀʏ ᴘʟᴀʏɪɴɢ ᴄᴀᴛᴄʜ ᴀɴᴅ ᴛʜʀᴏᴡ ᴡɪᴛʜ RDX ɪᴛs ғᴜɴ.",

    "I ʜᴇᴀʀᴅ ᴘʜᴏɢɪɴᴇ ɪs ᴘᴏɪsᴏɴᴏᴜs ʙᴜᴛ ɪ ɢᴜᴇss ʏᴏᴜ ᴡᴏɴᴛ ᴍɪɴᴅ ɪɴʜᴀʟɪɴɢ ɪᴛ ғᴏʀ ғᴜɴ.",

    "Lᴀᴜɴᴄʜ ʏᴏᴜʀsᴇʟғ ɪɴᴛᴏ ᴏᴜᴛᴇʀ sᴘᴀᴄᴇ ᴡʜɪʟᴇ ғᴏʀɢᴇᴛᴛɪɴɢ ᴏxʏɢᴇɴ ᴏɴ Eᴀʀᴛʜ.",

    "Yᴏᴜ sʜᴏᴜʟᴅ ᴛʀʏ ᴘʟᴀʏɪɴɢ sɴᴀᴋᴇ ᴀɴᴅ ʟᴀᴅᴅᴇʀs, ᴡɪᴛʜ ʀᴇᴀʟ sɴᴀᴋᴇs ᴀɴᴅ ɴᴏ ʟᴀᴅᴅᴇʀs.",

    "Dᴀɴᴄᴇ ɴᴀᴋᴇᴅ ᴏɴ ᴀ ᴄᴏᴜᴘʟᴇ ᴏғ HT ᴡɪʀᴇs.",

    "Aᴄᴛɪᴠᴇ Vᴏʟᴄᴀɴᴏ ɪs ᴛʜᴇ ʙᴇsᴛ sᴡɪᴍᴍɪɴɢ ᴘᴏᴏʟ ғᴏʀ ʏᴏᴜ.",

    "Yᴏᴜ sʜᴏᴜʟᴅ ᴛʀʏ ʜᴏᴛ ʙᴀᴛʜ ɪɴ ᴀ ᴠᴏʟᴄᴀɴᴏ.",

    "Tʀʏ ᴛᴏ sᴘᴇɴᴅ ᴏɴᴇ ᴅᴀʏ ɪɴ ᴀ ᴄᴏғғɪɴ ᴀɴᴅ ɪᴛ ᴡɪʟʟ ʙᴇ ʏᴏᴜʀs ғᴏʀᴇᴠᴇʀ.",

    "Hɪᴛ Uʀᴀɴɪᴜᴍ ᴡɪᴛʜ ᴀ sʟᴏᴡ ᴍᴏᴠɪɴɢ ɴᴇᴜᴛʀᴏɴ ɪɴ ʏᴏᴜʀ ᴘʀᴇsᴇɴᴄᴇ. Iᴛ ᴡɪʟʟ ʙᴇ ᴀ ᴡᴏʀᴛʜᴡʜɪʟᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ.",

    "Yᴏᴜ ᴄᴀɴ ʙᴇ ᴛʜᴇ ғɪʀsᴛ ᴘᴇʀsᴏɴ ᴛᴏ sᴛᴇᴘ ᴏɴ sᴜɴ. Hᴀᴠᴇ ᴀ ᴛʀʏ.",

     "ᴊᴀᴅᴀ ᴀᴀɴᴏ ᴍᴏɴᴜsᴀᴇ @AɴᴏɴʏᴍᴏᴜsD3061 🤭.",

)

@run_async

def insult(bot: Bot, update: Update):

    bot.sendChatAction(update.effective_chat.id, "typing") # Bot typing before send messages

    message = update.effective_message

    if message.reply_to_message:

      message.reply_to_message.reply_text(random.choice(SFW_STRINGS))

    else:

      message.reply_text(random.choice(SFW_STRINGS))

__help__ = """

- Reply to a text with /insult for insults.

"""

__mod_name__ = "ᏆΝՏႮᏞͲՏ🤬"

INSULT_HANDLER = DisableAbleCommandHandler("insult", insult)

dispatcher.add_handler(INSULT_HANDLER)
